app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "3JWukkq6j3tfUhbKTxHApuEfb/MX1WTB93DPC3TGxSlRtiweVPhidErRGH9g1crZmIGOTK+M7T/iPpAyRlp9fA=="], ["updated_at", "2020-12-03 23:10:50.883067"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = SecureRandom.base64(64)
        self.save!